backend/app/models/user.rb

UPDATE "users" SET "balance" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["balance", "4642.28"], ["updated_at", "2020-02-15 21:28:03.983033"], ["id", 5]]
---
  def stock_withdraw(amount)
    self.balance -= amount
    self.save