backend/app/controllers/auth_controller.rb

    def login
        user = User.find_by(email: login_params[:email])
        if user && user.authenticate(login_params[:password])
            token = JWT.encode({user_id: user.id}, secret, 'HS256')
            shares_map = Transaction.all.shares_map(user.transactions)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@test.com"], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1  [["user_id", 5]]

  def persist
      if request.headers['Authorization']
          encoded_token = request.headers['Authorization'].split(' ')[1]
          token = JWT.decode(encoded_token, secret)
          user_id = token[0]['user_id']
          user = User.find(user_id)
          shares_map = Transaction.all.shares_map(user.transactions)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1  [["user_id", 5]]