backend/app/controllers/transactions_controller.rb

  def index
    transactions = User.where(params[:user_id]).transactions
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1  [["user_id", 5]]

  def create
    @transaction = Transaction.create(transaction_params)
    @user = User.find(params[:user_id])
    @transactions = @user.transactions
    @sum = (transaction_params[:price].to_f * transaction_params[:quantity].to_i).round(2)
    @ticker = transaction_params[:ticker]
    @user.stock_withdraw(@sum)
    @ticker_shares = Transaction.find_ticker_shares(@transactions, transaction_params[:ticker])
---
INSERT INTO "transactions" ("price", "quantity", "ticker", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["price", "325.64"], ["quantity", 1], ["ticker", "AAPL"], ["user_id", 5], ["created_at", "2020-02-15 20:49:14.195410"], ["updated_at", "2020-02-15 20:49:14.195410"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1 AND "transactions"."ticker" = $2  [["user_id", 5], ["ticker", "AAPL"]]