backend/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1  [["user_id", 9]]
---
  def create
      user = User.create(user_params)
      if user.valid?
          user = user
          token = JWT.encode({user_id: user.id}, secret, 'HS256')
          shares_map = Transaction.all.shares_map(user.transactions)